--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀     BY(@AHMED_ALOBIDE)               ▀▄ ▄▀ 
▀▄ ▄▀      BY(@hussian_9)                  ▀▄ ▄▀ 
▀▄ ▄▀                                      ▀▄ ▄▀   
▀▄ ▄▀           (ملف الاوامر الانكلش)            ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "list2" then
return [[
➖➖➖➖➖➖➖➖➖➖➖➖
💀THE LAND OF THE FIRE💀
➖➖➖➖➖➖➖➖➖➖➖➖
💙اوامر الحماية الخاصة بالمجموعة💙
➖➖➖➖➖➖➖➖➖➖➖➖
🎴 للكتم اكتب مع يوزرة silent/
🎴  للطرد اكتب مع يوزرة kick/
🎴 بلوك اكتب مع يوزرة block/
🎴 حظر اكتب مع يوزرة ban/
🎴 مغادرة المجموعة اكتب kicker/
🎴 ايدي اكتب id/
➖➖➖➖➖➖➖➖➖➖➖➖
💙أوامر القفل وفتح الاعدادات الوسائط💙
➖➖➖➖➖➖➖➖➖➖➖➖
⚫️أستخدم للفتح mute/🔐
⚫️أستخدم للقفل unmute/🔓
🎴🔒قفل الصور اكتب mute photo/
🎴🔒قفل الفيديو اكتب mute video/
🎴🔒قفل الصور المتحركة mute gifs/
🎴🔒قفل الملفات اكتب mute doc/
🎴🔒قفل الكتابة اكتب mute text/
🎴🔒قفل الجميع صامتmute all/
➖➖➖➖➖➖➖➖➖➖
💙اعدادات المجموعة للمدير والادمن💙
➖➖➖➖➖➖➖➖➖➖
⚫️أستخدم للفتح unlock🔓
⚫️أستخدم للقفل lock🔐
🎴🔒قفل جهات الاتصال contacts
🎴🔒قفل الروابط للمجموعة links
🎴🔒قفل التكرارات flood
🎴🔒قفل الكلايش  spam 
🎴🔒قفل اللغة العربية arabic
🎴🔒قفل اللغة الانكلزية english
🎴🔒قفل اضافة اعضاءmember
🎴🔒قفل اشعارات الدخولtgservice
🎴🔒قفل الملصقات  sticker 
🎴🔒قفل الاشارة التاك tag
🎴🔒قفل السمايلات emoji
🎴🔒قفل البوتات bots
🎴🔒قفل اعادة توجية fwd
🎴🔒قفل الردودreply
🎴🔒قفل الدخول عبر الرابط join
🎴🔒قفل اليوزر نيم username
🎴🔒قفل الميديا media
🎴🔒قفل الكلمة السيئة badword
🎴🔒قفل المغادرة 🚶leave
🎴🔒قفل الحماية🛡 strict
🎴🔒قفل الكل🔐 all
➖➖➖➖➖➖➖➖➖➖
💙للمزيد من المعلومات حول البوت واستخدام💙
➖➖➖➖➖➖➖➖➖➖
🕵المطور @AHMED_ALOBIDE
🕵المطور @hussian_9
🕵المطور @Tiq_ll
]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"[#!/](list2)"
},
run = run 
}
end
