--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀     BY(@AHMED_ALOBIDE)               ▀▄ ▄▀ 
▀▄ ▄▀      BY(@hussian_9)                  ▀▄ ▄▀ 
▀▄ ▄▀                                      ▀▄ ▄▀   
▀▄ ▄▀         ملف الردود                      ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "ردود" then
return [[
💀THE LAND OF THE FIRE💀
➖➖➖➖➖➖➖➖➖➖
ردود ألــــــبـــــــــوت     ألـــــــجـــحـــيـم 
➖➖➖➖➖➖➖➖➖➖
(١) الحـمد الله
(٢) شـلونك 
(٣) سـخيف
(٤) ضـوجة
(٥) اوفـ
(٦) يـلة
(٧) مـعزوفة
(٩) اريـد عرك
(١٠) اريـد ببسي
(١١) احـبج
(١٢) احـبك
(١٣) شـتكول عل بوتات الجديدة
(١٤) مـنو اقوة بوت 
(١٥)شـكاعد تسوي هسة
(١٦) شـتكول عل زواحف
(١٧) شـنسوي هسة
(١٨) بـوس الاعضاء
(١٩) انـي احمد احبك
(٢٠) شـكو ماكو
(٢١) زهـراء 
(٢٢) شـغف
(٢٣) ليـش ولك تركتهة
(٢٤) ضـياء
(٢٥) مـسوين اكل
(٢٦) مـرحبا
(٢٧) هـلو
(٢٨) زواحـف
(٢٩) الـسلام عليكم
(٣٠) مـن هوة هبل
(٣١) ارعـن
(٣٢) مـنو احلى واحد
(٣٣) انـي منو
(٣٤) تـسلم
(٣٥) تـحبني
(٣٦) تـاحسك ساحف
(٣٧) شـكد
(٣٨) اغـير جو 
(٣٩) والله بواهـسي اروح للزوراء
(٤٠) شـغل السبلت 
(٤١) طـفي السبلت
(٤٢) نغـل 
(٤٣) امـداك
(٤٤) اسـتعداد
(٤٥) انـي جيت
(٤٦) طوطـي
(٤٧) اصيـل
(٤٨) صـوفي
➖➖➖➖➖➖➖➖➖➖
@AHMED_ALOBIDE🕵المطور 
@hussian_9🕵المطور 
]]
end

if not is_momod(msg) then
return "مو شغلك ودعبل 😎🖕🏿"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(ردود)"
},
run = run 
}
end